<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;

use Illuminate\Database\Seeder;

use Faker\Generator as Faker;
use Illuminate\Support\Str;
use App\Models\Product;
use App\Models\Order;
use App\Models\User;

use Illuminate\Support\Facades\Hash;
class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function user ()
    {
        $faker = \Faker\Factory::create();

        for ($i = 0; $i < 5; $i++) {
            $password = Hash::make(11111111);
            User::create([
                    'email' => $faker->unique()->freeEmail,
                    'name' => $faker->firstName,
                    'email_verified_at' => now(),
                    'password' => $password,
                    'admin' => 0,
                ]);         
        }
        return redirect()->route('admin.user.index');
    }

    public function product ()
    {
        for ($i = 0; $i < 5; $i++) {

            $input = ["Xiaomi 11T Pro", "OnePlus 9", "Samsung Galaxy A73 5G", "Xiaomi 12", "Samsung Galaxy S21 FE", "Xiaomi Poco F4 GT", "Samsung Galaxy S22","Google Pixel 6 Pro","OnePlus 10 Pro","Samsung Galaxy S22 Ultra","iPhone 14 Pro (Max)","Samsung SM-A032F (Galaxy A03)","ZTE Blade A71","Oppo A16","Vivo Y20","Realme C25Y","Xiaomi Poco M4 Pro 5G","Huawei Nova 8i","OnePlus Nord 2","Google Pixel 6","Xiaomi Redmi Note 11 4/64GB"];
            $rand_keys = array_rand($input, 2);

            $input2 = [
                "Цей смартфон стане непоганим рішенням для тих, кому потрібен апарат з місткою батареєю, а сучасний функціонал не такий важливий. Тут акумулятор на 5000 мАг, чого вистачить на 1,5-2 дні безперервної роботи у звичному режимі використання: дзвінки, браузер, медіа. Заряджання здійснюється через роз'єм micro USB.",
                "Смартфон оснащено 2 Гб оперативної та 32 Гб постійної пам'яті. Усього в слот розширення можна встановити 2 сім-карти та одну SD картку до 1 Тб. З переваг також варто відзначити непогану для бюджетного пристрою PLS матрицю з діагоналлю 6,5” і частотою оновлення 60 Гц. Основна камера на 8 Мп дозволяє робити непогані знімки, якщо світла достатньо. Тут варто розуміти, що мобільні телефони Samsung, у подібному ціновому сегменті – це компроміс, але всі основні завдання (дзвінки, інтернет, мультимедіа) вони вирішують.",
                "У смартфона IPS матриця з діагоналлю 6,52” та роздільною здатністю 1600 х 720 пікселів. Основна камера на 16 Мп з підтримкою автофокусу додатково оснащена об'єктивом, здатним розпізнавати контури предметів, що підвищує якість знімків при слабкому освітленні.",
                "Якість складання самого смартфона чудова – все щільно підігнано, немає жодних люфтів та скрипів. Окремо варто згадати Android 11 з мінімальною кількістю доробок (практично чистий), що дозволяє смартфону досить швидко працювати на своїх 3 Гб оперативної пам'яті. Загалом для цього бюджету це дуже вдале рішення до якого практично немає зауважень.",
                "За оснащенням та характеристикам перед нами досить типова бюджетна модель. Тут зарядка та підключення по USB Type-C, 3 Гб оперативної та 32 Гб постійної пам'яті. Дизайн – сильне місце телефону, він виглядає так, ніби задник зроблений із загартованого скла (хоча він пластиковий, як і рамка).",
                "Оснащений 8 ядерним процесором Qualcomm Snapdragon 460, на якому можна грати в сучасні мобільні ігри. Завдяки енергоефективним ядрам Cortex та акумулятору на 4000 мАг він може забезпечити пристойний час автономної роботи. Також смартфон оснащено 4 Гб оперативною та 64 Гб постійної пам'яті.
                Сканер відбитка пальця на бічній панелі працює як годинник, корпус щільно підігнаний, непоганий дизайн, відповідний ціні набір камер з підтримкою автофокусу – це ознаки дійсно хорошого недорогого гаджета.
                Звичайно, крім цих переваг, є й недоліки. Так заряджається пристрій від micro USB, розблокування за обличчям іноді спрацьовує саме по собі, на базі передостанній 10 Android з невеликими доробками. ",
                "Бюджетний смартфон з камерою на 50 Мп це можливо? Так, однак у реальному C25Y розробникам довелося піти на певні компроміси заради цього. ",
                "Смартфон оснащено дисплеєм на 6,5” з матрицею IPS. Роздільна здатність – 1600 х 720 пікселів. Яскравість у специфікаціях не вказують, проте вона дуже пристойна, на яскравому сонці ви можете читати з екрану без проблем.",
                "Процесор – восьмиядерний Unisoc Tiger T618, оперативної пам'яті – 4 Гб, постійної – 64 Гб. Акумулятор на 5000 мАг. На батареї варто зупинитись окремо – смартфон у режимі читання може протриматись на одному заряді до 30 годин. Пристрій працює на Android 11, ОС добре оптимізована. Сканер відбитка розташований на правій бічній грані, спрацьовує миттєво, користуватися ним зручно.
                Тепер про компроміси: виробник не оснастив смартфон NFC модулем, основний динамік розташований на спинці (що не всім буде зручно), а об'єктив на 50 Мп забезпечуватиме високу якість знімків лише за гарного освітлення.",
                "Ще один представник середньобюджетних смартфонів, з частотою оновлення 90 Гц. На відміну від попереднього учасника рейтингу матриця екрана тут AMOLED, а роздільна здатність нижче 1600 х 720 (HD). У дисплея високі показники яскравості та контрастності.",
                "Смартфон оснащено процесором Snapdragon 460 (досить економічний) та 4 Гб оперативної пам'яті. Сховище на 64 Гб може бути розширене SD картами загальним обсягом до 1 Тб (лоток приймача підтримує до 2-х SIM карток і однієї картки пам'яті). Для багатьох дуже важливим залишається наявність аудіовиходу 3,5 мм під навушники і в Oppo A53 він є. Також телефон підтримує кодек Apt-X (передача якісного сигналу з низькою затримкою), що, безсумнівно, порадує любителів гарного звуку.",
                "Зараз захищені телефони вкрай затребувані на українському ринку. Що не дивно, з огляду на обставини. Подібний смартфон стане чудовим помічником для військових, силовиків, охоронців та всіх, хто працює у складних умовах. ",
                "На додаток до підвищеної надійності йде надмісткий акумулятор на 8000 мАг. З урахуванням використання економічного 4-ядерного процесора MediaTek Helio A22 заряду вистачає на 40 годин безперервної розмови або 33 годин перегляду потокового відео. Оперативної пам'яті тут 4 Гб, постійної – 32 Гб. Дисплей IPS з діагоналлю 5,45” HD+ (1440 х 720) – він закритий ударостійким склом Corning Gorilla Glass.",
                "Смартфон підтримує функцію OTG, що дозволяє підключати до нього мишку, клавіатуру, зовнішні накопичувачі та іншу периферію. OTG-кабель входить до комплекту постачання.",
                "Дисплей на 6,6”, матриця IPS з роздільною здатністю 1080 х 2400 (Full HD), все це накрито міцним склом Corning Gorilla Glass 3. Частота оновлення – 90 Гц. Задник корпусу із загартованого скла, металева рамка.
                Окремо варто згадати блок-камер. Основний об'єктив тут на 50 Мп, і ще 4 сенсори кожен на 2 Мп. Загалом, з фотографіями у пристрою все чудово, є підтримка режиму HDR, є спеціальні режими для зйомки в темний час доби.",
                "За цю ціну ми отримуємо стильний смартфон з дуже тонкими рамками, з яскравим та контрастним екраном, що підтримує швидку зарядку, безконтактні платежі та оснащений акумулятором 5000 мАг.",
                "Смартфон оснащено останнім Qualcomm Snapdragon 888, що забезпечує дійсно приголомшливу продуктивність. Мінус у даного чіпсету лише один - він серйозно нагріває корпус під значними навантаженнями. При серфінгу чи звичних завданнях це майже непомітно. Оперативна пам'ять 8 Гб, постійна – 128 Гб.",
                "Дисплей 6,4”, OLED матриця з роздільною здатністю 1080 х 2400, частота оновлення 90 Гц, відтворення кольорів дуже реалістичне, запас яскравості значний. Керує системою процесор власної розробки компанії – Google Tensor оснащений додатковим чіпом безпеки Titan M2. Що стосується кібербезпеки, протоколи Titan M2 є одними з кращих, забезпечуючи безпеку ваших даних 24/7.",
                "Основний камерний модуль на 50 Мп, отримав оптичну стабілізацію та збільшену матрицю, що наближається за параметрами до якісних мильниць. Знімки виходять дуже світлими, з реалістичною передачею кольору.",
                "Смартфон захищений за стандартом IP68 від вологи та пилу, працює на новому Android 12 і є одним із найкращих бізнес-рішень на актуальному ринку завдяки стабільності роботи та підвищеній безпеці.",
                "Найкращою ілюстрацією надійності буде підтримка зйомки під водою. З такою функцією ви зможете зробити багато вражаючого контенту, незважаючи на те, що основна камера тут всього на 8 Мп.
                З корисних функцій для будівельників є рівень і висок, для туристів – датчик висоти та компас. І першим, і другим сподобається можливість управління в рукавичках та розблокування за допомогою faceUnlock.",
                "2 ГБ оперативи та 4-ядерний процесор на 1.3 ГГц – скромні показники, але помітите ви це лише у важких додатках. У звичайних ситуаціях смартфон не гальмує, оскільки працює на фірмовій оболонці Android 9: для неї продуктивності вистачає.",
                "Не стільки недоліком, скільки особливістю є екран із діагоналлю 5: у наш час, коли більшість смартфонів мають від 6,4, це незвично.
                Місткість акумулятора 4000 мА/год. Якщо ви вирушаєте у тривалий похід, то без повербанку не обійтися, але в інших ситіаціях заряду вистачить надовго.",
                "Чудовий смартфон без жодних застережень. Продуктивність для середньобюджетного сегмента на висоті: PUBG можна запускати на максималках.
                Досягається це завдяки 4 ГБ ОЗП та 8-ядерному процесору з частотою 2 ГГц. При цьому варто враховувати, що смартфон не є ігровим. Тобто він потягне ігри на максимальних налаштуваннях графіки, але через 15-20 хвилин CPU починає грітися і продуктивність може падати на 20-25%. Втім, сильного тротлінгу не буде.",
                "Головний недолік цієї моделі – відсутність роз'єму jack 3,5. А навушники точно знадобляться, тому що динамік поганий. Він «дзвенить», тому дивитися відео з таким динаміком це сумнівне задоволення, про музику і говорити не варто. Тобто потрібно буде купити навушники з виходом USB-Type-C або адаптер USB-Type-C/jack 3,5. ",
                "Із захистом у смартфона очікувано все добре: металеві кнопки, подвійний литий пластик, гумові борти. Цілком протиударним смартфон назвати не можна, тому що загартованого скла немає, що мінус, але телефон все одно відповідає стандарту IP68.",
                "Автономність смартфона 1,5-2 дні при активному використанні навіть з максимальною частотою екрану, в чому варто дякувати батареї на 5000 мА/год. Додайте сюди підтримку Fast Charge та блок на 33 Вт (йде в комплекті), і сидіти біля розетки точно не доведеться.",
            ];
            $rand_keys2 = array_rand($input2, 2);

            $rand = rand(20,100);
            Product::create([
                    'name' => $input[$rand_keys[0]],
                    'description' => $input2[$rand_keys2[0]],
                    'price' => $rand . '0',
                ]);         
        }
        return redirect()->route('admin.product.index');
    }

    public function order ()
    {

        for ($i = 0; $i < 5; $i++) {
            Order::create([
                    'product_id' => Product::all()->random()->id,
                    'user_id' => User::all()->random()->id,
                ]);         
        }
        return redirect()->route('admin.order.index');
    }
}
